Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.Select Method
Overload List
Name | Description
Select()
 Selects a logical weld from the model database. The logical weld identifier must be set.
 (Overrides ModelObject.Select().)
Select(BaseWeld)
 Selects the logical weld that a child weld belongs to.
Top
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace